[
    {
        "_template": true,
        "id": "template-post",
        "title": "template-post.md",
        "date": "YYYY-MM-DD",
        "mood": "the mood",
        "emoji": "emoji",
        "content": "## Your Post Title\n\nYour post content goes here. You can use markdown formatting.\n\n### Subheadings work too\n\nAnd regular paragraphs of text.",
        "picture": {
            "path": "path/to/your/image.jpg",
            "caption": "Optional caption for your image"
        },
        "spotify": {
            "title": "Song Title",
            "artist": "Artist Name",
            "link": "https://open.spotify.com/track/your-track-id"
        },
        "other_song": {
            "title": "Song Title",
            "artist": "Artist Name",
            "link": "https://open.spotify.com/track/your-track-id"
        }
    },
    {
        "id": "hello-world",
        "title": "hello-world.md",
        "date": "2025-08-11",
        "mood": "Sneaky",
        "emoji": "😏",
        "content": "## Welcome to my little blog!\n\nThis is my very first post. I wanted to create something that felt a bit more personal and nerdy than a standard blog template.\n\nHere, you can navigate my thoughts using familiar commands. Try typing `help` to see what you can do. It's simple, but I at least think it's neat.\n\nThis page is mainly for myself to jot down spurious thoughts, but who knows, maybe someone takes a smidgen of interest in something I have to say.\n\nRegardless, I hope you enjoy your stay.\n\n-- Ryan"
    },
    {
        "id": "four-months",
        "title": "four-months.md",
        "date": "2025-08-12",
        "mood": "Reflective",
        "emoji": "🌱",
        "content": "I've had some time to think in the last week of this internship, and, pardon my French, but damn. This summer was something else.\n\nTransparently, I came into this internship in a pretty rough headspace. Spring semester was pretty rough, & I feel like I learned what rock bottom is for myself. But sometimes you need to get completely knocked down to figure out who you actually are when you get back up.\n\nFunny how much can change in four months. Started the summer overthinking every interaction, second-guessing every decision. Now I'm here hiding easter eggs in documentation sites and somehow some senior people think to ask ME for advice. Wild.\n\nTherapy helped and continues to help. The gym helped (still don't know why I started going, but here we are). But mostly, I think meeting genuine people who saw something in me that I couldn't see in myself helped. Turns out when you stop trying so hard to be what you think people want, you actually become someone worth knowing.\n\nStill figuring it out, obviously. Still overthink things more than I should. But I'm learning to trust my instincts again, to believe that maybe I do belong in rooms I used to feel like an imposter in.\n\nI guess the guy who got hired at Apple at 19 was just trying to survive. The one heading back to finish school (kinda) knows what he brings to the table.\n\nAnd that's pretty cool I think.",
        "spotify": {
            "title": "absolutely",
            "artist": "VeriA",
            "link": "https://open.spotify.com/track/0TvT8xVIRa5giqAZIfkuPw"
        }
    },
    {
        "id": "cali-weather",
        "title": "cali-weather.md",
        "date": "2025-08-13",
        "mood": "Homesick",
        "emoji": "🌧️",
        "content": "Since I've now lived in California for ~9 months of my life (albeit, not consecutively), I am overly confident that I am the perfect person to draw attention to a major pitfall of living here--the lack of rain.\n\nLike, for real, what's up with that? I'm pretty certain that I've only ever seen it rain 3 times in those 9 months, and there's not a single instance in which I've thought to myself, \"Wow, this is what I call rain.\"\n\nNo, each supposed \"rain\" has been a TINY shower, if even that. Oftentimes it's simply fog or mist from the bay disguising itself as rain. That can't be allowed, there's gotta be some sort of rules or regulations for what can be called rain. Frankly, I don't know if I could see myself living somewhere without rain long term.\n\nI mean, don't get me wrong, California has absolutely beautiful weather. Temperature-wise it's pretty much phenomenal 95% of the time. I've lived in North Dakota & Texas, so living somewhere genuinely temperate & comfortable has been a joy. But the question remains--is that worth a lack of soothing, therapeutic rain?\n\nI'm unsure.\n\nSee attached, a picture of North Dakota after a beautiful rain.",
        "picture": {
            "path": "assets/blog/nodak-rain.jpg",
            "caption": "you're telling me you don't need this in your life? yeah, okay."
        },
        "spotify": {
            "title": "ripple",
            "artist": "plasky",
            "link": "https://open.spotify.com/track/1FkRVxXe039z6NYx2pK1HW"
        }
    },
    {
        "id": "yosemite",
        "title": "yosemite.md",
        "date": "2025-08-14",
        "mood": "Grateful",
        "emoji": "🏔️",
        "content": "Took a weekend trip to Yosemite with some of the other interns, and man, is this why people say to touch grass?\n\nThere's something lowkey surreal about being surrounded by these massive granite walls and waterfalls that just puts everything in perspective. Like, all the stuff you stress about day-to-day suddenly feels pretty small when you're staring up at 'em.\n\nI drove for like 9 hours, took way too many photos, and spent the evenings just hanging out and talking about everything and nothing. Made breakfast (pancakes, if you're curious. I make great ones, hmu for my recipe fr) for everyone on the last morning before we packed up. It felt good to take care of people who've quickly become very important to me.\n\nI think I forgot how therapeutic it can be to just exist, yk? In a beautiful place with people you actually enjoy being around too. No phones (mostly), no stress, just good company and good scenery.\n\nFeeling pretty lucky to have found people this summer who are down for adventures and who gave me a reason to become an extrovert. Sometimes the best part of any experience is just having the right people to share it with.\n\nVery grateful.",
        "picture": {
            "path": "assets/blog/yosemite.jpg",
            "caption": "these people are genuinely amazing. i love them dearly."
        },
        "spotify": {
        "title": "Tree Among Shrubs",
        "artist": "Men I Trust",
        "link": "https://open.spotify.com/track/2JKtCvtxP47fOMYi0BjMoY"
        }
    },
    {
        "id": "friends",
        "title": "friends.md",
        "date": "2025-08-15",
        "mood": "Loved",
        "emoji": "💛",
        "content": "Perhaps one of, if not the single most rewarding realizations one can make is as follows--a sense of self isn't something worth sacrificing for love. Neither platonic nor romantic.\n\nIf you've read the prior blog posts, you'll likely know where an opener like that leads for me. The people I've met this summer have been the most important and most fulfilling part of my summer, second to none (sorry Camera & Photos automation project. you were fun, but not that fun.).\n\nIt's not much of a stretch to say that the people I've met out here have truly saved me from a dark place. What has thoroughly confounded me, however, is the fact that not one of them did so knowingly. It came so naturally to them, to the point that they were surprised to learn the depth of my gratitude. Such a crucial puzzle, missing a few pieces in my life. And yet, how casually they filled in the gaps.\n\nThe last ~8 months of my life have taught me a lesson that I hadn't quite learned yet:\n\nHow beautiful it is to feel pain through loss, as grief is simply love persisting.\n\nAs like anyone reading this, I'm not a fan of sadness, heartbreak, or loss. However, isn't it wonderful that our love can run so deep to cause such visceral pain when it's lost or changed? I find myself thinking frequently lately--how lucky I am to feel this sorrow, to feel this longing. How lucky I am to miss you.\n\nA bit more situation specific, but the friends in question in this blog post have shown me a version of myself that I was unaware could exist and thrive. They've shown me kindness, compassion, and care. Most of all, they've shown that my true self is accepted. Hell, accepted isn't even the right word. My full, unapologetic self is seemingly what drew them in, no hesitations.\n\nWhat a feeling this is.",
        "picture": {
            "path": "assets/blog/friends.jpg",
            "caption": "L>R: andrew, darroll, myself, gia. i'd hire them if i were you, great engineers & even greater people."
        },
        "spotify": {
            "title": "Eyes in the Sun",
            "artist": "Florist",
            "link": "https://open.spotify.com/track/3PEE4FsATv0gvmYSUqZyI5"
        }
    },
    {
        "id": "the-drive",
        "title": "the-drive.md",
        "date": "2025-08-15",
        "mood": "Locked in",
        "emoji": "🚗",
        "content": "\"Wow, two blog posts in one day? What a treat!\" That's probably not what you're thinking, but that's okay! These blog posts aren't for anyone in specific, just a way to keep the ol' mind on its toes.\n\nAnyway, the topic--driving from California to North Dakota to Texas over the span of ~1 week. I had my car shipped out for the summer internship, and let me tell you: absolutely the right choice. I'd make that choice again 11/10 times. What I didn't consider, however, is the logistics of returning.\n\nNowhere to ship the car to in Texas for college, things in North Dakota that I require for my last two semesters, etc. Truly quite an example of man's folly--to act of desire as opposed to logic. Prior to this summer, I likely would have opted for the latter of the two. Hell, I DID opt for the latter, as I didn't bring my car for my 6 month CE last fall.\n\nBut you know what? What could be more illogical than suppressing a genuine desire?\n\nThat's not to say don't control your desires of course. I simply mean to say, you should gauge them against the bigger picture. Take my situation for example:\n\nCons of bringing my car:\n\n- Financials of shipping, gas, & maintenance\n\n- The drive back\n\nPros of bringing my car:\n\n- The drive back (should be absolutely beautiful!)\n\n- Freedom to explore California\n\n- The ability to spend more time with the people I care for\n\n- An excuse to spend more time with friends (yes, I WILL give you a ride!)\n\n- A better way to blast my music\n\nNow, I know that's not the most decisive or conclusive list. I'm also not saying that everyone needs their car everywhere. I'm sure I'm an oddball for enjoying driving, and I fully embrace that. What I DO mean to say, however, is the following:\n\nMoney comes back. Time does not.\n\nAnd of course, this is far from a groundbreaking stance. However, I challenge you to consider that more actively in your day-to-day. We're all living for the first time.\n\nWhy not treat someone? Why not treat yourself?\n\nAnyway, I start the drive tonight. I'll probably make ~5 hours after I leave Apple Park, probably get to Reno, NV around 10-11pm. Just 2 more 11 hour drives to get home!",
        "picture": {
            "path": "assets/blog/the-drive.png",
            "caption": "you can know i live in north dakota, i trust you. you should trust you too."
        },
        "spotify": {
            "title": "midnight cruisin'",
            "artist": "Kingo Hamada",
            "link": "https://open.spotify.com/track/37NPLfEZQQ0rZTa9SRqWBL"
        }
    },
    {
        "id": "texas",
        "title": "texas.md",
        "date": "2025-08-24",
        "mood": "Tired",
        "emoji": "🤠",
        "content": "Long time no see! 9 days since the last blog post, I'd bet you thought I was gone for good. On the contrary though, I successfully completed my 45 hours of driving & have arrived safely in Texas with everything but my sanity.\n\nShort post today given the aforementioned tiredness and sleep deprivation. Life sails smoothly, finished moving into my new place in Dallas for the year. Haven't met the roommates yet, but should be good. Miss my internship friends dearly, but am making plans behind the scenes to remedy that.\n\nAs you can likely tell since I've posted this successfully, I seem to have access to most of my typical SWE toolsuite despite being back in AppleCare. Very grateful for my AppleCare management, they've been absolute gems & have allocated me 1 hour per month to maintain/update a project of mine.\n\nVery grateful for Apple in its whole honestly. Never before have I been so taken care of by a company, it's quite hard to believe. It's like every person I meet there surpasses the last in terms of kindness. Even in the roughest stretch of my life, even when it was far from ideal to accommodate me, Apple has taken care of me. Truly blessed to be with 'em.\n\nNo picture for today, but at least check out the song. It's been stuck in my head for the last week and a half and refuses to stop looping up there. Thanks a lot Gia. 🙄\n\nAnyway, that's about all from me. Head empty, eyes heavy. You know the feeling.\n\nAddressed to no one and everyone at the same time - I hope you've been well.",
        "spotify": {
            "title": "Do You Like Me?",
            "artist": "Daniel Caesar",
            "link": "https://open.spotify.com/track/4deAN7JXhdHHifxOp0TTjU"
        }
    },
    {
        "id": "the-start",
        "title": "the-start.md",
        "date": "2025-08-26",
        "mood": "Academic",
        "emoji": "🏫",
        "content": "You know, I'm  not certain if there's much to talk about in today's blog entry. I'm not going to make this a daily thing unless something really comes to mind, you know? I'm guessing that I won't have much to talk about over the school year, but I think writing my thoughts out is likely beneficial for me regardless.\n\nI've started my classes at UT Dallas for the semester, and honestly, they seem fine. It's been a little tricky to maintain my newly found extrovertedness though. I'm not sure if it's a general lack of energy or if it's just a lack of like-minded people, but regardless of the cause it's been a little quiet. That's not necessarily a bad thing though! Having grown up in the midwest, I've come to truly appreciate the quiet.\n\nFor a while earlier this year, the quiet and solitude was hard for me to sit in. Very somber and isolating. Since the end of the summer, however, I feel I've regained most of my appreciation for the quiet moments.\n\nThat's something that I'm beyond happy to be able to say confidently in full honesty. It was a bit disorienting to lose that part of myself, as it's been a trait that I've always been able to fall back on when other things changed.\n\nAnyway, pulling away from the sappier emotions, I just signed up for my new gym & went for the first time today. It's a pretty nice place, it's called \"Amped\". It's a little bit over-the-top for my tastes (think neon lights and millennial slang), but it's a nice enough place. Plenty of machines. In that same vein, I just recently started taking creatine. Found a nice little container of creatine monohydrate for a decent price, & it's a tasty lil' fruit punch flavor. It's pretty good, I've been feeling pretty good, but holy moly does it make me thirsty. Apparently you're supposed to drink 8-10 glasses of water during the \"loading phase\", the first week where you take 2 servings a day.\n\nI'm not enough of a gym nut to continue down that rabbit hole, but it's been good. Glad to get back into the routine, even if it's changed.\n\nOnly constant is life is change, so we all oughta get used to it.\n\nSpotify song for the day is rather random, but groovy. Check it out. :)",
        "spotify": {
            "title": "What She Wants",
            "artist": "Femi Tahiru",
            "link": "https://open.spotify.com/track/2urfbYYv9JPE0JOz32yenY"
        }
    },
    {
        "id": "pokemon",
        "title": "pokemon.md",
        "date": "2025-09-07",
        "mood": "The very best, like no one ever was",
        "emoji": "🦖",
        "content": "I've realized over the last few months that minimizing my hobbies and passions to appear less \"nerdy\" doesn't reflect the person I want to be. In an effort to combat that, I've recently thrown myself back into my old hobby of collecting Pokémon cards.\n\nI grew up on the Pokémon games, with HeartGold being my first and forever favorite of the main series. Truly a masterpiece, and I stand by that stance with every fiber of my being. Totodile & Feraligatr have been my favorite Pokémon ever since, & I still love 'em.\n\nAnyway, yesterday I went to the Dallas Card Show. Bought a couple cards, traded a couple cards, the works. Overall, had a really solid time. Truthfully, I hoped to find someone to share the hobby with, but fell short of that goal by a ways. Such is life. I've never been one to let that get me down in the past, nor do I plan on becoming reliant on external sources for all happiness--I feel that's a dangerous pitfall of socializing.\n\nHowever, I was able to give away some cards to a lil' trainer that was just starting out in the hobby. I'd seen videos online of people doing the same, and, ever since seeing them, had wanted to do the same. I couldn't have expected, though, just how nice it felt to be able to do that. The cards, although somewhat rare, weren't terribly expensive.\n\nIt cost me very little, and yet, to the kid, meant so much. The way his face lit up, the way he showed the cards off to his parents. Hell, the way the parents' eyes lit up looking at their smiling son. I'm no benevolent, gifting savant or anything, but man, I plan on doing that again.\n\nI hope one day I can inspire someone to pass it forward. No expectation, simply hope. Hope for a more connected world, for compassionate children.\n\nThey're up next after all.",
        "picture": {
            "path": "assets/blog/pokemon.png",
            "caption": "depending on who sees this, this is either a flex or embarrassing."
        },
        "spotify": {
            "title": "Ecruteak City",
            "artist": "Super Lofi 64",
            "link": "https://open.spotify.com/track/06ipmxCPwyoZ9KdliVQ5PQ"
        }
    },
    {
        "id": "minecraft",
        "title": "minecraft.md",
        "date": "2025-09-11",
        "mood": "Melancholic",
        "emoji": "⛏️",
        "content": "While this post may be disguised as ramblings about the hit 2009 indie release Minecraft, it's actually the deranged 3 A.M. ramblings of a student who should surely be sleeping.\n\nIn all fairness, I am actually playing Minecraft right now. Well, \"playing\" may be putting it generously, as I've probably been AFK for nearly 45 minutes exploring the deepest crevices of my own mind. As Patrick Star would say, \"The inner machinations of my mind are an enigma.\" At least, that's what I've always thought he said in that episode, I've never fact checked myself.\n\nAnyway. I'm currently sitting in my little abode, quite literally carved into the side of a floating hunk of rock in The End, the game's liminal dimension that houses the final boss. Due to a particular mod I'm playing with, there is ambient breeze blowing and a rather ethereal track playing quietly.\n\nYou know, it's rather odd. It's hours like these where I find myself thinking back, reminiscing, if you will, about my childhood. How many times in my life have I been seated in front of a very similar screen playing this game? How many hours have I spent mining, crafting, building, and so forth? How many times did my parents walk into my room in the wee hours of the night to find me wide awake playing this very game on a school night, often before big tests?\n\nA silly thought, I know. Rather funny to think back on these specific situations. But truthfully, it's a bit harrowing. The more I grow, the more the focus of this nostalgia drifts away from the tenderness of these moments. It instead ebbs ever closer to the thought of \"these nights aren't coming back.\"\n\nI know, I know, rather dreary route for this entry to take, and for that I apologize. But I do mean the sentiment. There won't be another time in which the biggest worry of my life is if my few pieces of coal can finish smelting my iron.\n\nI'm well aware of the truths of this universe, that this gripe of mine simply boils down to \"part of growing up.\" And I know it, you know it - there's no going back. And yet, it's 3 A.M, I'm AFK in Minecraft...\n\nAnd I think I just want to stay here a little longer.\n\nI wrote more code just to share today's song, as it's what's playing in The End right now. Quite a beautiful song imho, would love if you gave it a listen.",
        "picture": {
            "path": "assets/blog/minecraft.png",
            "caption": "probably silly to some, but isn't this beautiful?"
        },
        "other_song": {
            "title": "Eternal Garden",
            "artist": "Dan Henig",
            "link": "https://www.youtube.com/watch?v=sOg2KWnO1c4"
        }
    },
    {
        "id": "woe",
        "title": "woe.md",
        "date": "2025-09-12",
        "encrypted_content": "FaMXqXp2DgYPGI7xg44LImDb5YB8a/R66Piewdq0ux+IMwNFjTLIYyJuDhCncGFh6KIvNDUOiK+ZQ+jbANoKtITzYLSFMjaFPM+u3ZS1OTC9VM88CcWPcBga5a3vKsC2sELyoIZ4mr1eTYMD++l7p13R2+tMHD39OyAnfpUmZLrcK/vsaMeKL6RySbEuiXR8/JKc+pGBPuY5iuxz+qRB00LrABJ1/d0C7WZNYsmXZuTy0J95mAS4FiRpY2wK1Q0qwmtSaGp3Hbv2HQXZ0HP9Ft8G/KEFg7okk0oEzx2uBZGKCYjDqtkomT1Xh8WUh1L7/YdJm/kHkEtxhsPybzoxn66GLkIBG9DZK0v+qu8PmqPTWuQqmgWPCx17qpU+W2QKpGy8GL9jUIh3451+UX8M5aSRSbVHRCUkIN9Bv8fOwTi8dRuwtjbSAaOH5XmIzCoCxbG1fwmAe4/57WoLUKy2vmfvKTv3Vg+Ia65GERGSKVJRSkMXZOwvSfuoYd8iZwTZYSV7qI4HZNrMsLBsCQCTjjQqLIAQW+HeXeMxRLN7c69zgqlN6I1R/VetKTfQgD7nFdFR6+QZRqpGdeyfQffMpS7UkdWkFHPkIHaUwHVeDn46M4pbgcyPydTURE41eWfHdtmUsUBV4Jtfwss6nz7CWypTorjPIHEprxSGWvN8fCuqgvvUAo8EB+9aHqgm61+CV8f0oZluqq/qe+uz1yIyf/gd04SgdFW6HppFFUVbtq7BFMJrRgV8FYSfEp/lTczXWQQcVP7rnPP/HUW8kC1RNTSh9pdtKhKvaVL1oDtZObjFWw3hmdoDcgishpb/FR6h6S8tjbItYoJGNG4ZfaB+pynhb2sa9MjZIg2NF/HWdZgzyY0//kkW/QNpodk/Dnc75hNnul4CH/bzVrQxour63Nvka3/KAhb0Gs/6diPi9/WK9URyszW3xgAWgAbeC84S5AI8IZJY7uOhugj5nP+dzpAHI36WbxamKNAFP2PR4vvCpPcntwAwYRhKwfOTGOe5aNjhMd8cvh3Y5+GuvjAb41SqoJRI8b414tt4vZTXQYVbEBkpiLcSyx0Gjjhgpo2q0LJm3XxmnwE72plJ0R3lBT309mVZIhXSxuA5Z4I41Pzq5ZVG4eK/WBA3m7s2IHrRuPSExIdPJcJWBvyMWghrUaGD+MXTM4kMP5UtDNZxmwKGVOZYBAIfKfKGCAKHSkmdp1VBrvnBGt8ORBMTUTuNrGSYrjT3Cw1iUUg0105qnEmLBTFGVwQNXgKhkhuqL6Amd4wPNFYhjht656YTRSISwPvXU6mU7jhU6H7MB6qF2GTxUvkx7LkPtE19ITkhtl55PmlFHTX2F5U0qA8/Bzaf9nxsuKtlxAw61RGl7Y0AHE6R3m6rBxXn0BjuofAu0LmKcCpY5au9QqJZUs+CtZBKJK6LKH4k5SyGqVBVxO0aen0AUGMczp4TRouFs+C1zrytYFShSbTHYKnxpNxJkcKTaWUkQXxByWntjY12Z5gzxa2bldBqit9QcedVm5ZX32brDL+oYB7khdk14olmKnrEbvpwKfACQzMCJ7fwc4WN07fdLDhCqP7Ncqe1rpURCTFFmEHQeP2mF2FHJgVknYclWFpPQsmAXZnwEZP/G6K41gHH8YFMiLf1AoBt5gvHgdwin9YVF0ij9JqG610LnEyR6PrySqzAyDgr7DlJ+JmgdYljpxhDyW5lK8OulsHMbPEP5SsP49Fmw30tk7PAv4jb38tdzhF4rpm95b+5i8ovhiZOXjDgsDoFbLp1G+0TStkLMh2xpiIKmd1tZSd8eklp8vDRoDLO6nEGHD6aJicLEr87tOQ6DsAT/h0rYcD8GmRzMgY1LiaLXb31j+rIq06wK1QMUnfu8LVQBW16XC57ZGuVHJuFE/vb84dIuUtt8h90igNHGc8pf7QK5oF066jmjg5fKDtSbM78C17LUD/rtNZ/wnyqD/fldD+TUvaaSfg0ctSFUpUrMjG/UoHle+koNx3uJI1DF3KZSsRpZR8Sveth9mflKYVASRtGhQm/Tj2aPv/X7xh/H00d5epoLpyITL2ePVEnkNku39PZw2w1kUQCPKh40QqP/FHlEuW3pZLY/ZdoGQRmJqt42JTP7t2JE3+Xv6q/uvYHQ3Y4VU4DFPKOQ7kHHu8SErLzhumase0eDEuiVT7aaNGwM7A84pbzAFnHfPDZstTugFKsDSjFy4gCBfSEuCAWmq9SYQHW4R/6HyFAFkWUdOkGUUhaf8hC/8qQmkP9WWX723Svyi+M9uz/cLGnItFJxTZ1WnQ5joRStqs8T3Efrqzwg2rxI+drMdtgtk1XJT/WMQ8K9C689wTmtWtwJeMdKMTr405lf4qDGvtoQyIQpSodqh9d84nXsSBQbEuGJVNELfRhTOamJk4HxhowCeIa80UOn87leurSYD8DxpYDfHn3DuVpykqeOjgrkn54EBX1Qt9OJjcBzjySvigAV2XS0l4pCVTKhSxciLigu9j0sGQ/O0UtQPpKISCeZmvbahdR1DoeAwaDoJx/qSBos/pf1uNimFZTKFoekjtVnfulTbv0+uCL2g5r51es0D89QZREWnxhgjr4W9nnt3fvczla3QWhm6xTXerREIkjkSYDiIPLwILpYUDoZLj8hBUrAeqIvQSxih9bbn6z3/phjWG3PqzQtjNfEURRpgTuOLfvpNM017ui2I8eBvSvXoRFoHO8v+n4mxEGCh10ShpykAzNdW/c8ZBLnGzGBRwGhQKgNK3o/NUeWr24QmVOnx74MHOILg7RKVxrBrTO8OL0jVqHnxY6prJyA6DNghcjkhcqa8YdW51qKJ2UE4FJdfxwrM9mCbqVyYeD4wnKXGNex6V9JOtHMiwNQkMNgedSWWnxladEF3M+crxlIqydb8f/1e1siB4FjDsLhHXNf3oDASli0yuGLk0xhVRNp6JBu20BC1ddAfAMajW/jAMxXvtzv/HtBOrOc9WQCAT5mWOkMSLvJuvDK0opOsQ3dCJupUf7VtTg7swGF7M+vTZRgz0xTZ50vkmDLFNv8O2HbaHlZsUBzFkAmlgIg8stj1odxh049/CbF/TqDqtIKKnomo8u3exGKLUYj3BT+eF9CL2gNo+R2bVd6MBFtUVBtI9tJC9vZhxESnyo/AXfdKkw9HVOynr1A5lYJ1kp1V1WtGn3jtFbNsFaPO5pi/55+ST8264yGlMYY89eRRM54JQccbV1hZ1cdrgeta1J1khYQ9ylUGTseGdfO4l9Q+odELDnlP0sfp8FZ8eobRZqzinEFXd8IFvmwj3Pria26h8WOxhnX6tHw7VB+bFfwZ93D9ilpyMwgGhXmfSPEtkTueH2fHjrd8cw16+ecJkYYGrxAmFiIKZERJKJs4kbsuAjJFgY1MJFrSxvKZJKWWE9F5OIcClQA2E2rl97K8YkBkZmEocTQTDNHqX9RiCOb+YJWSDCAvggXZ1TuuiuIPuazwNrpSyaE+RslIS2BY0Lcp4VboxkyFN+yqX4lMetN197IwfcA6+2OAZNs3c9COOgot+jHo0kY3rkGjmJ7RahYR1mFH5dh8WPD99KSTqdP5xkK2GzQVIA5aXNaXgYcLSGSHpxRfm56B575TUGwpHtzl3I8Ys6fX/IT0l6fS+jU1lTr1R4UDSDjGe62yoQPOqwQYAi5P5STdr554SoDdzqMLZuAxUdY9UOeb361d5Zl0OTGSFqfUGYslgVxT3rFE9b1pZFrs/QkJ86ILRAga5JbiKk4JxNr8fdfvrO4hrPszfbziqYQnuQuCSljvCdg03MFobWsLqJu5eG7wVZccVqWODMdzdFTu1YAXkkGR31nkcy+/71rAG+xMmMBkKVZ3xgO+UqoHSn8wSlDZzpjHzXyfuqhZBuHjNsL2E0eRGsdpcNPOYDyOEldDvlLgMRX1W8yJYdX3rGAPNCjoEGEHzsY8b9Lb8F9CJHgdMwhPRb72jKoQD8BHjFzTUg4CxLubDcN6e9cBYAgdp23aUYdLptiNxJWi3zKkDDihCdkbLzayvzX9lXjKlyxUd3MSSSjGjuFJZnlKPYQxJe/41BfqUNwS5OGtZfEcmTn/M67qnt/fRqh0RJOiT41O9H4Efh0fY9IKLW4v6ne3wtNWUSUV2FGmsCHmEXWAeTkgZ7whPZSH3nTcYXOGUB7AqLWC+aC2lL4/xcrO6/7eJLsAgJolkDxwB/h0GUbxl1BEzzq0ZfAnsW//y8Kc4h26CaLBlFRxnCSsR0R0zQNgtjAdrGpyz6PQOo9EKJ1oYopF0KiTdbReg5M+47TsB69rexhRqbZ+AqD45Ey4sx5Jlutxmq6oq0xQVPunHPWVUeDbuJRlILmIOJyqdhdU0AvksAQ+pCQkbq2ziwBWUBvlbjiRmsYvd5+Etwy9KB6dSOr1peak9xPUHOfqG6XnwRFgrZ1VDj/c+VROihNtUWKXNWq4pneBdUX5JAFand3Z7P/rLY5zv/COh7s5KtOERGC71jtv+3z2TihyQtp1GTTKFMlGhLRreBmVCJspIxK8IR9gzVZh0zdDMCl0ZcVWvyyuQ2o+JFLdKM8MvlJuqZaAp+AQlqV9Fk/kgT4qiEG9a6v5YDdPes0uOUJLrbNRQ+fT2wPifz9t7B7NHjd78hG3rsUy6hbo9H1gZ0HMy24dup6l/GEPoOnHjyIffZqQynwdtiyjb1RtsXfGzmZtoLRyWTIInFt3155UTBjUswXjf2dHW3ELpfik1FhUFVY4rS+VYGQL4yWhi+FrJDyM83gpJsafc9h5NNCeZcKNPqdNWG4+CSLartnhGanyMHURCc2cgU3UKtuo02mInkR7f4Ompl1saupxq7pUllfHUQJvphxOo1t/1kS+fRRogFXoRnaN7qDpVF/NTgSirBBPTuK7pcHT+r/MKs/JIR8p1uSXBqMxeARGISYTboBNfCbuxOYCJ5nKkwxwxVOUBwzUGiVzjWaDQZHMgcjpBnyrtXXAIAKdf+d4GsNoD+rbyENxf9ffLVMZzsHT4efGHp+kkPL3Cg6Jd/kdkHh+SuRAyV586JKqzjhXm4RZW+fNtjBhgVILf5GWt79An3Ma7SU1ENX3V1YF5YRC1a0YvlnwTmkUWswgAbvPyvYttR5+o7nkzL+oU6Hw6tNJCk/zgRwYmV0yxzMrkFWf/65EuJk/A1PLyDuspe8m8ZEVABJcydOq8nmwoosVv5J3CN3DT30lKH2O8d/4wuMxWnqLZzDmb0lh8xkIoCJTUBbGxQ6jYoa5NwRJRFAbG8lYWuCutC",
        "encrypted_metadata": "0oodvlssBacSvnCTYcVk1uCm8VHWd0P+46z31mFgDrzx5cCEVg3CqLs1LVhqwuDjYO7/+wST1dFe20K4FazWlP5kizFhLSz4VgVvjfXz9NAcK1mj9FTRX8T1yZBmjJw+HUaBIzba5JaivSt1WsITwiboUAVsyB/PLWYPT94fWC9v5slpeYlG7xn1AkEmp8ZqVuZ1TUBl/7DIslx1thc/uv7M/dQqGgf2SH21Wf5Q7b3QjbjxlqfEV4H48ejGpfk/WCM="
    },
    {
        "id": "growth",
        "title": "growth.md",
        "date": "2025-10-05",
        "mood": "Different",
        "emoji": "🌳",
        "content": "Hey. I'm still here. Don't worry.\n\nLike a comfortable friendship, you might not always hear from me, we'll always be able to pick up from the moment we left off, no questions asked.\n\nAnyway. As expected, September was a rather quiet month for blog posts. As I mentioned a few posts back, I don't foresee these blog posts becoming incredibly common or anything. That's especially true if the rest of the academic year continues with the same level of monotony that I've been feeling for the first 6 weeks. It's rather boring - wake up, go to school, go to work, go to the gym, go to bed. There's not much variation and thus that leads to monotony, and, perhaps worse, complacency.\n\nI have been still operating under the \"yes\" ideology though, agreeing to every invite I receive. Since my last post, I've mentored at two separate technical workshops, taken on 4 (really cool) mentees, and locked myself into mentoring at the country's largest 24 hour hackathon alongside other miscellaneous social hangouts. I will say though, regarding the socialization -- While I haven't necessarily held up to my extrovertedness that I found in California, the situation isn't all bad. The few people that I have connected with here in Dallas make it *incredibly* easy to say yes to hanging out. There's definitely some cool people down here, even if I've only found a few.\n\nThe biggest theme of this chapter of my life seems to be growth, both physically and mentally. Physically via the gym of course, which I've still been hitting 5-6 times a week. I just recently reached 170lbs., solidifying my spot as the heaviest person in my family, which is a bit of an odd feeling as the youngest of 3 sons. Shockingly to me though is how the mental growth has simultaneously been the more difficult & more enlightening of the two types. It's been a long, lonely, reflective journey thus far, and I've come to realize that it's a journey that never really ends. While I do feel much more at peace with where I am in the journey, especially in regards to my springtime issues, I do feel strongly about the acknowledgement of the past.\n\nRecently, I released a musical piece on all major streaming platforms titled \"kintsugi\". For those unaware, kintsugi (金継ぎ) is the Japanese art of repairing broken pottery by mending the cracks with gold, silver, or platinum. The technique takes what is otherwise a damaged, undesirable mess into works of art. What speaks to me most is the philosophy behind just that -- it's not aiming to hide the cracks, to pretend they never happened. It's quite the opposite, highlighting the shattering, emphasizing the imperfections.\n\nAfter this spring, I had wanted so badly to hide the damage from those I loved. To distance myself from the pain, from the damage. To deny how broken I was, how helpless I was to put myself back together.\n\nWhat a naive thought. It truthfully took me quite some time to find this resolve and mentality, but please, if take a single notion away from my entire blog site, let it be the following:\n\nYou are the most beautiful version of yourself now, breaks and all. Every single person in this world has scars, and to deny them is to deny others the chance to see, to acknowledge, to love them.\n\nIf you're like me and cannot easily find it within yourself to accept the message above, then take it the logical route. Would you want to deprive another person the chance to draw their own conclusions? To take their autonomy from them, draw their conclusions for them?\n\nI know I wouldn't.\n\nBeauty in breakage, growth through grief, love alongside learning.\n\nRemember that.",
        "spotify": {
            "title": "when it comes to you",
            "artist": "1Jay",
            "link": "https://open.spotify.com/track/5debj8aC29Rzyj3vQYIzuH"
        }
    }
]
