[
    {
        "_template": true,
        "id": "template-post",
        "title": "template-post.md",
        "date": "YYYY-MM-DD",
        "mood": "the mood",
        "emoji": "emoji",
        "content": "## Your Post Title\n\nYour post content goes here. You can use markdown formatting.\n\n### Subheadings work too\n\nAnd regular paragraphs of text.",
        "picture": {
            "path": "path/to/your/image.jpg",
            "caption": "Optional caption for your image"
        },
        "spotify": {
            "title": "Song Title",
            "artist": "Artist Name",
            "link": "https://open.spotify.com/track/your-track-id"
        }
    },
    {
        "id": "hello-world",
        "title": "hello-world.md",
        "date": "2025-08-11",
        "mood": "Sneaky",
        "emoji": "😏",
        "content": "## Welcome to my little blog!\n\nThis is my very first post. I wanted to create something that felt a bit more personal and nerdy than a standard blog template.\n\nHere, you can navigate my thoughts using familiar commands. Try typing `help` to see what you can do. It's simple, but I at least think it's neat.\n\nThis page is mainly for myself to jot down spurious thoughts, but who knows, maybe someone takes a smidgen of interest in something I have to say.\n\nRegardless, I hope you enjoy your stay.\n\n-- Ryan"
    },
    {
        "id": "four-months",
        "title": "four-months.md",
        "date": "2025-08-12",
        "mood": "Reflective",
        "emoji": "🌱",
        "content": "I've had some time to think in the last week of this internship, and, pardon my French, but damn. This summer was something else.\n\nTransparently, I came into this internship in a pretty rough headspace. Spring semester was pretty rough, & I feel like I learned what rock bottom is for myself. But sometimes you need to get completely knocked down to figure out who you actually are when you get back up.\n\nFunny how much can change in four months. Started the summer overthinking every interaction, second-guessing every decision. Now I'm here hiding easter eggs in documentation sites and somehow some senior people think to ask ME for advice. Wild.\n\nTherapy helped and continues to help. The gym helped (still don't know why I started going, but here we are). But mostly, I think meeting genuine people who saw something in me that I couldn't see in myself helped. Turns out when you stop trying so hard to be what you think people want, you actually become someone worth knowing.\n\nStill figuring it out, obviously. Still overthink things more than I should. But I'm learning to trust my instincts again, to believe that maybe I do belong in rooms I used to feel like an imposter in.\n\nI guess the guy who got hired here at 19 was just trying to survive. The one heading back to finish school (kinda) knows what he brings to the table.\n\nAnd that's pretty cool I think.",
        "spotify": {
            "title": "absolutely",
            "artist": "VeriA",
            "link": "https://open.spotify.com/track/0TvT8xVIRa5giqAZIfkuPw"
        }
    },
    {
        "id": "cali-weather",
        "title": "cali-weather.md",
        "date": "2025-08-13",
        "mood": "Homesick",
        "emoji": "🌧️",
        "content": "Since I've now lived in California for ~9 months of my life (albeit, not consecutively), I am overly confident that I am the perfect person to draw attention to a major pitfall of living here--the lack of rain.\n\nLike, for real, what's up with that? I'm pretty certain that I've only ever seen it rain 3 times in those 9 months, and there's not a single instance in which I've thought to myself, \"Wow, this is what I call rain.\"\n\nNo, each supposed \"rain\" has been a TINY shower, if even that. Oftentimes it's simply fog or mist from the bay disguising itself as rain. That can't be allowed, there's gotta be some sort of rules or regulations for what can be called rain. Frankly, I don't know if I could see myself living somewhere without rain long term.\n\nI mean, don't get me wrong, California has absolutely beautiful weather. Temperature-wise it's pretty much phenomenal 95% of the time. I've lived in North Dakota & Texas, so living somewhere genuinely temperate & comfortable has been a joy. But the question remains--is that worth a lack of soothing, therapeutic rain?\n\nI'm unsure.\n\nSee attached, a picture of North Dakota after a beautiful rain.",
        "picture": {
            "path": "assets/blog/nodak-rain.jpg",
            "caption": "you're telling me you don't need this in your life? yeah, okay."
        },
        "spotify": {
            "title": "ripple",
            "artist": "plasky",
            "link": "https://open.spotify.com/track/1FkRVxXe039z6NYx2pK1HW"
        }
    },
    {
        "id": "yosemite",
        "title": "yosemite.md",
        "date": "2025-08-14",
        "mood": "Grateful",
        "emoji": "🏔️",
        "content": "Took a weekend trip to Yosemite with some of the other interns, and man, is this why people say to touch grass?\n\nThere's something lowkey surreal about being surrounded by these massive granite walls and waterfalls that just puts everything in perspective. Like, all the stuff you stress about day-to-day suddenly feels pretty small when you're staring up at 'em.\n\nI drove for like 9 hours, took way too many photos, and spent the evenings just hanging out and talking about everything and nothing. Made breakfast (pancakes, if you're curious. I make great ones, hmu for my recipe fr) for everyone on the last morning before we packed up. It felt good to take care of people who've quickly become very important to me.\n\nI think I forgot how therapeutic it can be to just exist, yk? In a beautiful place with people you actually enjoy being around too. No phones (mostly), no stress, just good company and good scenery.\n\nFeeling pretty lucky to have found people this summer who are down for adventures and who gave me a reason to become an extrovert. Sometimes the best part of any experience is just having the right people to share it with.\n\nVery grateful.",
        "picture": {
            "path": "assets/blog/yosemite.jpg",
            "caption": "these people are genuinely amazing. i love them dearly."
        },
        "spotify": {
        "title": "Tree Among Shrubs",
        "artist": "Men I Trust",
        "link": "https://open.spotify.com/track/2JKtCvtxP47fOMYi0BjMoY"
        }
    },
    {
        "id": "friends",
        "title": "friends.md",
        "date": "2025-08-15",
        "mood": "Loved",
        "emoji": "💛",
        "content": "Perhaps one of, if not the single most rewarding realizations one can make is as follows--a sense of self isn't something worth sacrificing for love. Neither platonic nor romantic.\n\nIf you've read the prior blog posts, you'll likely know where an opener like that leads for me. The people I've met this summer have been the most important and most fulfilling part of my summer, second to none (sorry Camera & Photos automation project. you were fun, but not that fun.).\n\nIt's not much of a stretch to say that the people I've met out here have truly saved me from a dark place. What has thoroughly confounded me, however, is the fact that not one of them did so knowingly. It came so naturally to them, to the point that they were surprised to learn the depth of my gratitude. Such a crucial puzzle, missing a few pieces in my life. And yet, how casually they filled in the gaps.\n\nThe last ~8 months of my life have taught me a lesson that I hadn't quite learned yet:\n\nHow beautiful it is to feel pain through loss, as grief is simply love persisting.\n\nAs like anyone reading this, I'm not a fan of sadness, heartbreak, or loss. However, isn't it wonderful that our love can run so deep to cause such visceral pain when it's lost or changed? I find myself thinking frequently lately--how lucky I am to feel this sorrow, to feel this longing. How lucky I am to miss you.\n\nA bit more situation specific, but the friends in question in this blog post have shown me a version of myself that I was unaware could exist and thrive. They've shown me kindness, compassion, and care. Most of all, they've shown that my true self is accepted. Hell, accepted isn't even the right word. My full, unapologetic self is seemingly what drew them in, no hesitations.\n\nWhat a feeling this is.",
        "picture": {
            "path": "assets/blog/friends.jpg",
            "caption": "L>R: andrew, darroll, myself, gia. i'd hire them if i were you, great engineers & even greater people."
        },
        "spotify": {
            "title": "Eyes in the Sun",
            "artist": "Florist",
            "link": "https://open.spotify.com/track/3PEE4FsATv0gvmYSUqZyI5"
        }
    },
    {
        "id": "the-drive",
        "title": "the-drive.md",
        "date": "2025-08-15",
        "mood": "Locked in",
        "emoji": "🚗",
        "content": "\"Wow, two blog posts in one day? What a treat!\" That's probably not what you're thinking, but that's okay! These blog posts aren't for anyone in specific, just a way to keep the ol' mind on its toes.\n\nAnyway, the topic--driving from California to North Dakota to Texas over the span of ~1 week. I had my car shipped out for the summer internship, and let me tell you: absolutely the right choice. I'd make that choice again 11/10 times. What I didn't consider, however, is the logistics of returning.\n\nNowhere to ship the car to in Texas for college, things in North Dakota that I require for my last two semesters, etc. Truly quite an example of man's folly--to act of desire as opposed to logic. Prior to this summer, I likely would have opted for the latter of the two. Hell, I DID opt for the latter, as I didn't bring my car for my 6 month CE last fall.\n\nBut you know what? What could be more illogical than suppressing a genuine desire?\n\nThat's not to say don't control your desires of course. I simply mean to say, you should gauge them against the bigger picture. Take my situation for example:\n\nCons of bringing my car:\n\n- Financials of shipping, gas, & maintenance\n\n- The drive back\n\nPros of bringing my car:\n\n- The drive back (should be absolutely beautiful!)\n\n- Freedom to explore California\n\n- The ability to spend more time with the people I care for\n\n- An excuse to spend more time with friends (yes, I WILL give you a ride!)\n\n- A better way to blast my music\n\nNow, I know that's not the most decisive or conclusive list. I'm also not saying that everyone needs their car everywhere. I'm sure I'm an oddball for enjoying driving, and I fully embrace that. What I DO mean to say, however, is the following:\n\nMoney comes back. Time does not.\n\nAnd of course, this is far from a groundbreaking stance. However, I challenge you to consider that more actively in your day-to-day. We're all living for the first time.\n\nWhy not treat someone? Why not treat yourself?\n\nAnyway, I start the drive tonight. I'll probably make ~5 hours after I leave Apple Park, probably get to Reno, NV around 10-11pm. Just 2 more 11 hour drives to get home!",
        "picture": {
            "path": "assets/blog/the-drive.png",
            "caption": "you can know i live in north dakota, i trust you. you should trust you too."
        },
        "spotify": {
            "title": "midnight cruisin'",
            "artist": "Kingo Hamada",
            "link": "https://open.spotify.com/track/37NPLfEZQQ0rZTa9SRqWBL"
        }
    },
    {
        "id": "texas",
        "title": "texas.md",
        "date": "2025-08-24",
        "mood": "Tired",
        "emoji": "🤠",
        "content": "Long time no see! 9 days since the last blog post, I'd bet you thought I was gone for good. On the contrary though, I successfully completed my 45 hours of driving & have arrived safely in Texas with everything but my sanity.\n\nShort post today given the aforementioned tiredness and sleep deprivation. Life sails smoothly, finished moving into my new place in Dallas for the year. Haven't met the roommates yet, but should be good. Miss my internship friends dearly, but am making plans behind the scenes to remedy that.\n\nAs you can likely tell since I've posted this successfully, I seem to have access to most of my typical SWE toolsuite despite being back in AppleCare. Very grateful for my AppleCare management, they've been absolute gems & have allocated me 1 hour per month to maintain/update this site.\n\nVery grateful for Apple in its whole honestly. Never before have I been so taken care of by a company, it's quite hard to believe. It's like every person I meet here surpasses the last in terms of kindness. Even in the roughest stretch of my life, even when it was far from ideal to accommodate me, Apple has taken care of me. Truly blessed to be here.\n\nNo picture for today, but at least check out the song. It's been stuck in my head for the last week and a half and refuses to stop looping up there. Thanks a lot Gia. 🙄\n\nAnyway, that's about all from me. Head empty, eyes heavy. You know the feeling.\n\nAddressed to no one and everyone at the same time - I hope you've been well.",
        "spotify": {
            "title": "Do You Like Me?",
            "artist": "Daniel Caesar",
            "link": "https://open.spotify.com/track/4deAN7JXhdHHifxOp0TTjU"
        }
    }
]
