[
    {
        "_template": true,
        "id": "template-post",
        "title": "template-post.md",
        "date": "YYYY-MM-DD",
        "content": "## Your Post Title\n\nYour post content goes here. You can use markdown formatting.\n\n### Subheadings work too\n\nAnd regular paragraphs of text.",
        "picture": {
            "path": "path/to/your/image.jpg",
            "caption": "Optional caption for your image"
        },
        "spotify": {
            "title": "Song Title",
            "artist": "Artist Name",
            "link": "https://open.spotify.com/track/your-track-id"
        }
    },
    {
        "id": "hello-world",
        "title": "hello-world.md",
        "date": "2025-08-11",
        "content": "## Welcome to my little blog!\n\nThis is my very first post. I wanted to create something that felt a bit more personal and nerdy than a standard blog template.\n\nHere, you can navigate my thoughts using familiar commands. Try typing `help` to see what you can do. It's simple, but I at least think it's neat.\n\nThis page is mainly for myself to jot down spurious thoughts, but who knows, maybe someone takes a smidgen of interest in something I have to say.\n\nRegardless, I hope you enjoy your stay.\n\n-- Ryan"
    },
    {
        "id": "four-months",
        "title": "four-months.md",
        "date": "2025-08-12",
        "content": "I've had some time to think in the last week of this internship, and, pardon my French, but damn. This summer was something else.\n\nTransparently, I came into this internship in a pretty rough headspace. Spring semester was pretty rough, & I feel like I learned what rock bottom is for myself. But sometimes you need to get completely knocked down to figure out who you actually are when you get back up.\n\nFunny how much can change in four months. Started the summer overthinking every interaction, second-guessing every decision. Now I'm out here hiding easter eggs in documentation sites and somehow some senior people think to ask ME for advice. Wild.\n\nTherapy helped and continues to help. The gym helped (still don't know why I started going, but here we are). But mostly, I think meeting genuine people who saw something in me that I couldn't see in myself helped. Turns out when you stop trying so hard to be what you think people want, you actually become someone worth knowing.\n\nStill figuring it out, obviously. Still overthink things more than I should. But I'm learning to trust my instincts again, to believe that maybe I do belong in rooms I used to feel like an imposter in.\n\nI guess the guy who got hired here at 19 was just trying to survive. The one heading back to finish school (kinda) knows what he brings to the table.\n\nAnd that's pretty cool I think.",
        "spotify": {
            "title": "absolutely",
            "artist": "VeriA",
            "link": "https://open.spotify.com/track/0TvT8xVIRa5giqAZIfkuPw"
        }
    },
    {
        "id": "cali-weather",
        "title": "cali-weather.md",
        "date": "2025-08-13",
        "content": "Since I've now lived in California for ~9 months of my life (albeit, not consecutively), I am overly confident that I am the perfect person to draw attention to a major pitfall of living here--the lack of rain.\n\nLike, for real, what's up with that? I'm pretty certain that I've only ever seen it rain 3 times in those 9 months, and there's not a single instance in which I've thought to myself, \"Wow, this is what I call rain.\"\n\nNo, each supposed \"rain\" has been a TINY shower, if even that. Oftentimes it's simply fog or mist from the bay disguising itself as rain. That can't be allowed, there's gotta be some sort of rules or regulations for what can be called rain. Frankly, I don't know if I could see myself living somewhere without rain long term.\n\nI mean, don't get me wrong, California has absolutely beautiful weather. Temperature-wise it's pretty much phenomenal 95% of the time. I've lived in North Dakota & Texas, so living somewhere genuinely temperate & comfortable has been a joy. But the question remains--is that worth a lack of soothing, therapeutic rain?\n\nI'm unsure.\n\nSee attached, a picture of North Dakota after a beautiful rain.",
        "picture": {
            "path": "assets/blog/nodak-rain.jpg",
            "caption": "you're telling me you don't need this in your life? yeah, okay."
        },
        "spotify": {
            "title": "ripple",
            "artist": "plasky",
            "link": "https://open.spotify.com/track/1FkRVxXe039z6NYx2pK1HW"
        }
    },
    {
        "id": "yosemite",
        "title": "yosemite.md",
        "date": "2025-08-14",
        "content": "Took a weekend trip to Yosemite with some of the other interns, and **man**, is this why people say to touch grass?\n\nThere's something lowkey surreal about being surrounded by these massive granite walls and waterfalls that just puts everything in perspective. Like, all the stuff you stress about day-to-day suddenly feels pretty small when you're staring up at 'em.\n\nI drove for like 9 hours, took way too many photos, and spent the evenings just hanging out and talking about everything and nothing. Made breakfast (pancakes, if you're curious. I make great ones, hmu for my recipe fr) for everyone on the last morning before we packed up. It felt good to take care of people who've quickly become very important to me.\n\nI think I forgot how therapeutic it can be to just exist, yk? In a beautiful place with people you actually enjoy being around too. No phones (mostly), no stress, just good company and good scenery.\n\nFeeling pretty lucky to have found people this summer who are down for adventures and who gave me a reason to become an extrovert. Sometimes the best part of any experience is just having the right people to share it with.\n\nVery grateful.",
        "picture": {
            "path": "assets/blog/yosemite.jpg",
            "caption": "these people are genuinely amazing. i love them dearly."
        },
        "spotify": {
        "title": "Tree Among Shrubs",
        "artist": "Men I Trust",
        "link": "https://open.spotify.com/track/2JKtCvtxP47fOMYi0BjMoY"
        }
    }
]
